---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.CannotPutSpaceInOption
source: html/69117678-eed0-c984-c173-510ad843ebbd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.CannotPutSpaceInOption Property

MEP space must be in the Main Model

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPutSpaceInOption { get; }
```